In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as m

In [28]:
data_file1 = pd.read_csv("SWVF_1_22.txt", sep=",", quotechar='"', header=0, encoding='ISO-8859-1', na_values=['NA'],low_memory=False)

In [ ]:
data_file2 = pd.read_csv("SWVF_23_44.txt", sep=",", quotechar='"', header=0, encoding='ISO-8859-1', na_values=['NA'],low_memory=False)

In [ ]:
data_file3 = pd.read_csv("SWVF_45_66.txt", sep=",", quotechar='"', header=0, encoding='ISO-8859-1', na_values=['NA'],low_memory=False)

In [ ]:
data_file4 = pd.read_csv("SWVF_67_88.txt", sep=",", quotechar='"', header=0, encoding='ISO-8859-1', na_values=['NA'],low_memory=False)

In [29]:
df = pd.concat([data_file1,data_file2,data_file3,data_file4], axis=0, join='outer', join_axes=None, ignore_index=False,
          keys=None, levels=None, names=None, verify_integrity=False, copy=True)

In [30]:
df.head()

,SOS_VOTERID,COUNTY_NUMBER,COUNTY_ID,LAST_NAME,FIRST_NAME,MIDDLE_NAME,SUFFIX,DATE_OF_BIRTH,REGISTRATION_DATE,VOTER_STATUS,...,GENERAL-11/08/2016,PRIMARY-05/02/2017,PRIMARY-09/12/2017,GENERAL-11/07/2017,PRIMARY-05/08/2018,GENERAL-08/07/2018,GENERAL-11/06/2018,PRIMARY-05/07/2019,PRIMARY-09/10/2019,GENERAL-11/05/2019
0,OH0024843333,18,2854607,KERBER,RYAN,R,NaN,1991-05-08,2018-10-07,ACTIVE,...,NaN,NaN,NaN,NaN,NaN,NaN,X,NaN,NaN,NaN
1,OH0024912882,18,2863244,ALLEN,MASSEIAH,A,NaN,2000-01-18,2018-10-16,ACTIVE,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,OH0024963536,18,2869946,PALLAS,KAYLA,ROSE,NaN,1988-12-06,2018-12-10,ACTIVE,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,OH0024977167,5,145646,BELLAR,RACHEL,JOANNA,NaN,1999-07-08,2018-10-23,ACTIVE,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,OH0025021489,13,6194973,HUBBLE,RODERICK,DWAYNE,II,1985-03-17,2019-02-28,ACTIVE,...,X,NaN,NaN,X,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
df.shape

(7700810, 108)

In [123]:
features = list(df)

In [124]:
na_bool = np.array(df.isna().any())

In [125]:
na_int = np.array(df.isnull().sum())

In [138]:
na = list(zip(features,na_bool,na_int))

In [141]:
na_df = pd.DataFrame(na, columns = ['feature','na_bool','na_number'])

In [143]:
na_df

                feature  na_bool  na_number
0           SOS_VOTERID    False          0
1         COUNTY_NUMBER    False          0
2             COUNTY_ID    False          0
3             LAST_NAME     True        396
4            FIRST_NAME     True          8
..                  ...      ...        ...
103  GENERAL-08/07/2018     True    7456409
104  GENERAL-11/06/2018     True    3240121
105  PRIMARY-05/07/2019     True    7236638
106  PRIMARY-09/10/2019     True    7696060
107  GENERAL-11/05/2019     True    7138102

[108 rows x 3 columns]

In [147]:
na_df.to_csv ('MissingValues-Overview_OhioVoterFiles.csv', index=None, header=True, sep=',')

In [148]:
df.to_csv ('OhioVoterFiles.csv', index=None, header=True, sep=',')